"""
  Данный модуль предназначен для хэширования паролей и проверки их на надежность.
  By AID
"""

#=============================================================================================

def hashing(password):
  k = list()
  #TODO дописать функция хэширования!
  for i in range(len(password)):
    k += password[i]

  return k

#=============================================================================================

def varify_password(password):
  if (len(password) < 6):
    print("Слишком мало символов в пароле! Минимум должно быть 6 символов!")
    return False
  #TODO Дописать другие условия проверки пароля